Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: The `quote-requests` channel is going to be managed as a AMQP queue, as that's the only connector on the classpath. If not indicated otherwise, like in this example, Quarkus uses the channel name as AMQP queue name. So, in this example, the application sends messages to the `quote-requests` queue.
zh_cn: `quote-requests` 通道将被作为一个AMQP队列来管理，因为这是classpath上唯一的连接器。如果没有另行说明，如本例中所示，Quarkus将使用通道名称作为AMQP队列名称。因此，在本例中，应用程序将消息发送给 `quote-requests` 队列。

source: The `sam.yaml` syntax is beyond the scope of this document. There's a couple of things that must be highlighted just in case you are going to craft your own custom `sam.yaml` deployment files.
zh_cn: `sam.yaml` 语法已经超出了本文档的范围。有几件事情必须强调，以防你要制作你自己的自定义 `sam.yaml` 部署文件。

source: The `send` method writes records to Kafka inside the transaction, without waiting for send receipt from the broker. Messages pending to be written to Kafka will be buffered, and flushed before committing the transaction. It is therefore recommended configuring the `@OnOverflow` `bufferSize` in order to fit enough messages, for example the `max.poll.records`, maximum amount of records returned in a batch.
zh_cn: `send` 方法将记录通过事务写入 Kafka，而无需等待来自代理的发送回执。 等待写入 Kafka 的消息将被缓冲，并在提交事务之前刷新。 因此，建议配置 `@OnOverflow` `bufferSize` 以适应足够的消息，例如 `max.poll.records`，即批处理中返回的最大记录数。

source: The `settings.json` placed in the root of your project directory or in the workspace will need the following workaround in your test configuration:
zh_cn: 在您的项目根目录或工作区的 `settings.json` 文件中，针对测试配置添加以下配置项目：

source: The `stream` methods require a transaction to work.
zh_cn: `stream` 方法的运行需要事务。

source: The `stream` methods require a transaction to work. + As they perform I/O operations, they should be closed via the `close()` method or via a try-with-resource to close the underlying `ResultSet`. If not, you will see warnings from Agroal that will close the underlying `ResultSet` for you.
zh_cn: `stream` 方法的运行需要事务。+ 由于这些stream开头的方法会执行I/O操作，所以应该通过 `close()` 方法或try-with-resource来关闭底层的 `ResultSet` 。否则你会看到来自Agroal的警告，它会为你关闭底层的 `ResultSet` 。

source: The `target/manage.sh` script is for managing your lambda using the AWS Lambda Java runtime. This script is provided only for your convenience. Examine the output of the `manage.sh` script if you want to learn what aws commands are executed to create, delete, and update your lambdas.
zh_cn: `target/manage.sh` 脚本是用于使用AWS Lambda Java runtime管理你的lambda。此脚本只是为了方便你而提供。如果你想了解执行哪些aws命令来创建、删除和更新你的lambdas，请检查 `manage.sh` 脚本的输出。

source: The `upn` claim is defined by the {mp-jwt} spec as preferred claim to use for the `Principal` seen via the container security APIs.
zh_cn: 这个 `upn` 声明(claim)被{mp-jwt}规范定义为首选声明，用做为被container security APIs所能见的 `Principal` 。

source: The `xray` propagator will need the https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/aws[aws] extension to be added as a dependency to your project.
zh_cn: `xray` propagator需要将 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/aws[aws] 扩展作为依赖添加到您的项目中。

source: The above command should return `["first"]` indicating that we have only one increment thus far.
zh_cn: 上面的命令应该返回 `["first"]` ，表明到目前为止我们只有一个增量。

source: The above creates a `Metadata` object we can add to the `Message` being produced, which retrieves the OpenTelemetry `Context` to extract the current span for propagation.
zh_cn: 以上代码创建了一个 `Metadata` 对象，我们可以将该对象添加到生成的 `Message` 中，并且该对象可以获取OpenTelemetry的 `Context` 来抽取当前的span用以传播。

source: The above example shows a few different ways the API can be used. The first method simply calls begin, does some work and commits it. This created transaction is tied to the CDI request scope, so if it is still active when the request scope is destroyed then it will be automatically rolled back. This removes the need to explicitly catch exceptions and call `rollback`, and acts as a safety net against inadvertent transaction leaks, however it does mean that this can only be used when the request scope is active. The second example in the method calls begin with a timeout option, and then rolls back the transaction.
zh_cn: 上面的例子显示了几种不同的API使用方法。第一个方法是简单地调用begin，做一些工作并提交。这个创建的事务是与CDI请求范围相联系的，所以如果它在请求范围被破坏时仍处于活动状态，那么它将被自动回滚。这样就不需要明确地捕捉异常和调用 `rollback` ，并作为一个安全措施来防止无意中的事务泄露，然而这也意味着这只能在请求范围处于活动状态时使用。方法调用中的第二个例子以一个超时选项开始，然后回滚事务。

source: The above example simulates sending a Cognito principal with an HTTP request to your HTTP Lambda.
zh_cn: 上面的例子模拟向你的HTTP Lambda发送一个带有HTTP请求的Cognito 主体。

source: The above sequence of commands should update the https://github.com/vert-x3/vertx-redis-client/blob/master/src/main/java/io/vertx/redis/client/Command.java[`Command.java`] file, so it includes all the possible commands supported by a particular Redis version.
zh_cn: 以上的几行命令会更新 link:https://github.com/vert-x3/vertx-redis-client/blob/master/src/main/java/io/vertx/redis/client/Command.java[`Command.java`] 文件，使其包含指定版本的 Redis 的所有支持的命令。

source: The all-open Kotlin plugin tells the compiler not to mark as final, those classes with the annotations highlighted (customize as required)
zh_cn: all-open Kotlin插件告诉编译器不要把那些有注解的类标记为final类（可以按需自定义）

source: The all-open configuration required, as per Maven guide above
zh_cn: 按照上面的Maven指南，需要配置all-open插件

source: The amount of milliseconds waiting for a graceful shutdown of the Kafka producer Type: _int_
zh_cn: 等待Kafka生产者平滑关闭的毫秒数 类型: _int_

source: The application built in this guide is quite simple: the user can add elements in a list using a form and the list is updated.
zh_cn: 本指南中构建的应用程序非常简单：用户可以使用一个表单在列表中添加元素并更新列表。

source: The application can also run as a native executable. But, first, we need to instruct Quarkus to enable _ssl_ (if the remote API uses HTTPS). Open the `src/main/resources/application.properties` and add:
zh_cn: 该应用程序也可以作为一个本地可执行文件运行。但是，首先，我们需要指示Quarkus启用 _ssl_ （如果远程API使用HTTPS）。打开 `src/main/resources/application.properties` ，并添加：

source: The application is packaged using:
zh_cn: 该应用程序是用以下方式打包的：

source: The application is using bearer token authorization and the first thing to do is obtain an access token from the Keycloak Server in order to access the application resources:
zh_cn: 该应用程序使用bearer token授权，首先要做的是从Keycloak服务器获得一个访问token，以便访问应用程序资源：

source: The associated configuration would be:
zh_cn: 相关的配置如下：

source: The back-pressure is handled by AMQP _credits_. The outbound connector only requests the amount of allowed credits. When the amount of credits reaches 0, it waits (in a non-blocking fashion) until the broker grants more credits to the AMQP sender.
zh_cn: 背压力是由AMQP _credits_ 来处理的。出站连接器只请求允许的信用额度。当信用额度达到0时，它就会等待（以非阻塞方式），直到代理授予AMQP发送者更多的信用额度。

source: The bearer token is issued by a Keycloak Server and represents the subject to which the token was issued for. For being an OAuth 2.0 Authorization Server, the token also references the client acting on behalf of the user.
zh_cn: 不记名令牌是由Keycloak服务器颁发的，并代表令牌发放对象的主体。对于OAuth 2.0授权服务器来说，该令牌还引用了代表用户的客户端。

source: The below code snippet shows how we can create dynamic clients using the configurations in <<multiple-clients-configuration>>.
zh_cn: 下面的代码片段显示了我们如何使用 link:#multiple-clients-configuration[[多个Redis客户端]] 中的配置创建动态客户端。

source: The broker hostname Type: _string_
zh_cn: 代理的主机名 类型: _string_

source: The broker port Type: _int_
zh_cn: 代理端口 类型: _int_

source: The browser must use the `vertx-eventbus` JavaScript library to consume the message:
zh_cn: 浏览器必须使用 `vertx-eventbus` JavaScript库来消费该信：

source: The central idea behind Quarkus is to do at build-time what traditional frameworks do at runtime: configuration parsing, classpath scanning, feature toggle based on classloading, and so on.
zh_cn: Quarkus的中心思想是在构建时做传统框架在运行时做的事情：配置解析、classpath扫描、基于classloading的功能切换，等等。

source: The code is a bit more involved. To write to a database, we need a transaction, therefore we use `Panache.withTransaction` to obtain one (asynchronously) and proceed to call the `persist` method. The `persist` method returns a `Uni` that emits the result of the insertion of the fruit in the database. Once the insertion completes (which plays the role of the continuation), we create a `201 CREATED` HTTP response.
zh_cn: 这代码要更复杂一些。想要写入数据库，我们需要一个事务。因此我们使用 `Panache.withTransaction` 来获取一个（异步），然后调用 `persist` 方法。 `persist` 方法返回一个 发出`fruit`插入到数据库中结果的`Uni`。一旦插入完成（它起到延续的作用），我们就会创建一个 `201 CREATED` 的HTTP响应。RESTEasy Reactive会自动将请求体读取为JSON并创建 `Fruit` 实例。

source: The code is a bit more involved. To write to a database, we need a transaction. So we use `Panache.withTransaction` to get one (asynchronously) and call the `persist` method when we receive the transaction. The `persist` method is also returning a `Uni`. This `Uni` emits the result of the insertion of the fruit in the database. Once the insertion completes (and that's our continuation), we create a `201 CREATED` response. RESTEasy Reactive automatically reads the request body as JSON and creates the `Fruit` instance.
zh_cn: 代码稍微复杂一些。要写入数据库，我们需要一个事务。所以我们用 `Panache.withTransaction` 来获取一个（异步），并在接收到事务时调用 `persist` 方法。 `persist` 方法也返回一个 `Uni`。这个 `Uni` 发出水果插入数据库的结果。一旦插入完成（这就是我们的延续），我们创建一个 `201 CREATED` 响应。RESTEasy Reactive会自动将请求体读取为JSON并创建 `Fruit` 实例。

source: The code is pretty straightforward. Every day at 10:15am, the counter is incremented.
zh_cn: 代码非常简单明了。每天上午10点15分，计数器递增。

source: The code of the application developed in the xref:getting-started.adoc[Getting Started Guide].
zh_cn: 在 xref:getting-started.adoc[入门指南] 中开发的应用程序代码。

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
zh_cn: Quarkus和Kubernetes的组合为创建可伸缩、快速和轻量级的应用程序提供了理想的环境。Quarkus通过工具、预构建集成、应用程序服务等显著提高了开发人员的生产率。

source: The community will fix security bugs for the latest major.minor version published at https://quarkus.io/get-started/.
zh_cn: 社区将修复最新的major.minor版本安全漏洞，发布于 https://quarkus.io/get-started/。

source: The companion object holds all the methods not related to a specific instance allowing for general management and querying bound to a specific type.
zh_cn: companion object持有所有与特定实例无关的方法，允许进行一般管理和与特定类型绑定的查询。

source: The complete example is available in the `kafka-panache-quickstart` {quickstarts-tree-url}/kafka-panache-quickstart[directory].
zh_cn: 完整的例子可以参考 `kafka-panache-quickstart` {quickstarts-tree-url}/kafka-panache-quickstart[directory].

source: The completed greeter application from the xref:getting-started.adoc[Getting Started Guide]
zh_cn: 来自 link:getting-started.html[《入门指南》] 的完整的greeter应用程序

source: The configuration is based on the official https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer Configuration]. If you are looking for more details about the different configuration options, please take a look at this documentation,
zh_cn: 以下配置基于官方文档 link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer Configuration]。如果您想要查看不同配置选项的更多细节，请参看该文档,

source: The configuration keys are structured as follows:
zh_cn: 配置键的结构如下：

source: The configuration of the created Kafka broker can be customized using `@ResourceArg`, for example:
zh_cn: 创建Kafka broker的配置可以通过使用 `@ResourceArg` 来自定义，例如：

source: The connection string, given on the admin console, such as `demo-c--bjsv-ldd-cvavkc-a.bf2.kafka.rhcloud.com:443`
zh_cn: 在管理控制台所给出的连接字符串，例如 `demo-c—​bjsv-ldd-cvavkc-a.bf2.kafka.rhcloud.com:443`

source: The connection timeout in milliseconds Type: _int_
zh_cn: 连接超时以毫秒为单位 类型: _int_

source: The connector converts incoming AMQP Messages into Reactive Messaging `Message<T>` instances. `T` depends on the _body_ of the received AMQP Message.
zh_cn: 连接器将传入的AMQP消息转换为响应式消息 `Message<T>` 实例。 `T` 取决于收到的AMQP消息的 _body_ 。

source: The connector only sends that amount of messages concurrently. No other messages will be sent until at least one in-flight message gets acknowledged by the broker. Then, the connector writes a new message to Kafka when one of the broker’s in-flight messages get acknowledged. Be sure to configure Kafka’s `batch.size` and `linger.ms` accordingly.
zh_cn: Connector只会并行发送指定数量的消息。在至少一个in-flight的消息被broker确认之前，其他消息都不会被发送。然后，当broker中有in-flight的消息得到确认时，connector才会向Kafka写入一个新的消息。请确保相应地配置Kafka的 `batch.size` 和 `linger.ms` 属性。

source: The connector uses the Vert.x AMQP client underneath. More details about this client can be found in the https://vertx.io/docs/vertx-amqp-client/java/[Vert.x website].
zh_cn: 连接器在下面使用Vert.x AMQP客户端。关于这个客户端的更多详情，请参阅 link:https://vertx.io/docs/vertx-amqp-client/java/[Vert.x网站] 。

source: The consumed / populated Kafka topic. If neither this property nor the `topics` properties are set, the channel name is used Type: _string_
zh_cn: 被消费/生产消息的Kafka主题。如果这个属性和 `topics` 属性都没有设置，则使用通道名称。 类型: _string_

source: The consumed `KafkaRecordBatch` message is passed to the `KafkaTransactions#withTransactionAndAck` in order to handle the offset commits and message acks.
zh_cn: 消费的 `KafkaRecordBatch` 消息被传递给 `KafkaTransactions#withTransactionAndAck` ，以处理偏移提交和消息确认。

source: The consumer `client.id` is configured according to the number of clients to create using `mp.messaging.incoming.[channel].partitions` property.
zh_cn: 消费者 `client.id` 会根据使用 `mp.messaging.incoming.[channel].partitions` 属性创建的客户端数量进行配置。

source: The container running the resource to test against, for example PostgreSQL via Testcontainers, is assigned an IP address from the container's network. Use the container's "public" IP from its network and the "unmapped" port number to connect to the service. The Testcontainers library usually return connection strings without respecting the container network, so additional code is needed to provide Quarkus the "correct" connection string using the container's IP on the container network and the _unmapped_ port number.
zh_cn: 运行要测试资源的容器，例如通过Testcontainers启用的PostgreSQL，会从容器的网络中分配到一个IP地址。使用容器网络中的 "公共 "IP和 "未映射 "的端口号来连接到服务。Testcontainers库通常在不遵从容器网络规则的情况下返回连接字符串，所以需要额外的代码来为Quarkus提供 "正确的 "连接字符串，以使用容器网络中的IP和 _未映射_ 的端口号。

source: The core foundation of every good open source project is open discussion and collaboration. Quarkus is committed to this belief. We've enabled GitHub Discussions so the community can have open communication. This gives a focal point for the community to ask and answer questions regarding the project. This means all of that great knowledge can be shared and is discoverable. Additionally, other conversations about the Quarkus Community can be had there as well. Come collaborate with us.
zh_cn: 每个好的开源项目的核心基础是公开讨论和合作。Quarkus致力于这一信念。我们已经启用了GitHub讨论，以便社区能够进行公开交流。这为社区提供了一个焦点，以提出和回答关于项目的问题。这意味着所有这些伟大的知识都可以被分享和发现。此外，关于Quarkus社区的其他对话也可以在这里进行。来与我们合作吧。

source: The corresponding deserializer class needs to be subclassed. So, let's create a `FruitDeserializer` that extends the `ObjectMapperDeserializer`.
zh_cn: 对应的反序列化器类也需要被子类化。因此，让我们创建一个 `FruitDeserializer` 来继承 `ObjectMapperDeserializer` 。

source: The corresponding deserializer class needs to be subclassed. So, let's create a `FruitDeserializer` that extends the generic `JsonbDeserializer`.
zh_cn: 相应的反序列化器类需要被子类化。因此，让我们创建一个 `FruitDeserializer` 来继承 `JsonbDeserializer` 。

source: The cost of making up to 2 remote calls per every incoming bearer or code flow access token can sometimes be problematic.
zh_cn: 每一个传入的不记名流(bearer flow)或授权码流(code flow)访问令牌要进行多达2次的远程呼叫，其开销有时会是个问题。

source: The current tenant's discovered link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect Configuration Metadata] is represented by `io.quarkus.oidc.OidcConfigurationMetadata` and can be either injected or accessed as a `SecurityIdentity` `configuration-metadata` attribute.
zh_cn: 当前租户发现的 link:https://openid.net/specs/openid-connect-discovery-1_0.html#ProviderMetadata[OpenID Connect配置元数据] 由 `io.quarkus.oidc.OidcConfigurationMetadata` 表示，可以作为 `SecurityIdentity` `configuration-metadata` 属性注入或访问。

source: The current version of the project.
zh_cn: 项目的当前版本。

source: The default behaviour of Jackson can be restored by setting `quarkus.jackson.write-dates-as-timestamps=true` in your `application.properties`. If you want to change the format for a single field, you can use the `@JsonFormat` annotation.
zh_cn: Jackson的默认行为可以通过在你的 `application.properties` 中设置 `quarkus.jackson.write-dates-as-timestamps=true` 来设置。如果你想改变单个字段的默认行为，你可以使用 `@JsonFormat` 注解。

source: The default cache uses a token as a key and each entry can have `TokenIntrospection` and/or `UserInfo`. It will only keep up to a `max-size` number of entries. If the cache is full when a new entry is to be added then an attempt will be made to find a space for it by removing a single expired entry. Additionally, the cleanup timer, if activated, will periodically check for the expired entries and remove them.
zh_cn: 默认的缓存使用一个令牌作为密钥，每个条目可以有 `TokenIntrospection` 和/或 `UserInfo` 。它只保留最多数量的条目 `max-size` 。如果要添加一个新的条目时，缓存已经满了，那么将试图通过删除一个过期的条目来为它找到一个空间。此外，清理计时器，如果被激活，将定期检查过期的条目并将其删除。

source: The default implementation allows you to define permissions using config in `application.properties`. An example config is shown below:
zh_cn: 默认实现允许您使用 `application.properties` 中的配置来定义权限。下面是一个配置的例子：

source: The default support for AWS security only maps the principal name to Quarkus security APIs and does nothing to map claims or roles or permissions. You have full control on how security metadata in the lambda HTTP event is mapped to Quarkus security APIs using implementations of the `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` interface. By implementing this interface, you can do things like define role mappings for your principal or publish additional attributes provided by IAM or Cognito or your Custom Lambda security integration.
zh_cn: 对AWS安全的默认支持只是将主体名称映射到Quarkus安全API，并没有对声明、角色或权限进行映射。你可以使用 `io.quarkus.amazon.lambda.http.LambdaIdentityProvider` 接口的实现来完全控制lambda HTTP事件中的安全元数据是如何被映射到Quarkus安全API的。通过实现这个接口，你可以做一些事情，比如为你的主体定义角色映射，或者发布由IAM或Cognito或你自定义的Lambda安全集成提供的额外的属性。

source: The default tenant's `OidcConfigurationMetadata` is injected if the endpoint is public.
zh_cn: 如果端点是公开的，则默认租户的 `OidcConfigurationMetadata` 会被注入。

source: The default value is 60 seconds.
zh_cn: 默认值是60秒。

source: The deserializer classname used to deserialize the record's key Type: _string_
zh_cn: 用于反序列化记录的键值的反序列化器的类名 类型: _string_

source: The deserializer classname used to deserialize the record's value Type: _string_
zh_cn: 用于反序列化记录的值的反序列化器的类名 类型: _string_

source: The easiest way to create a new Quarkus project is to open a terminal and run the following command:
zh_cn: 创建一个新的Quarkus项目最简单的方法是打开终端并运行以下命令：

source: The easiest way to define your transaction boundaries is to use the `@Transactional` annotation on your entry method (`javax.transaction.Transactional`).
zh_cn: 定义你的事务边界的最简单的方法是在你的入口方法上使用 `@Transactional` 注释( `javax.transaction.Transactional` )。

source: The easiest way to register a class for reflection is to use the `@RegisterForReflection` annotation:
zh_cn: 为反射注册一个类的最简单方法是使用 `@RegisterForReflection` 注解：

source: The elements are stored in MongoDB.
zh_cn: 这些元素被存储在MongoDB中。

source: The elements used via reflection are not part of the call tree so they are dead code eliminated (if not called directly in other cases). To include these elements in your native executable, you need to register them for reflection explicitly.
zh_cn: 通过反射使用的元素不是调用树的一部分，所以它们是被消除的死代码（如果不是在其他情况下直接调用）。要在你的本地可执行文件中包含这些元素，你需要为反射明确地注册它们。

source: The endpoint obtains the user principal from the JAX-RS `SecurityContext`. This will be non-null for a secured endpoint.
zh_cn: 该节点通过 JAX-RS `SecurityContext` 获取用户principal。对于受保护节点它将永不为null。

source: The endpoint returns a `CompletionStage` indicating the asynchronous nature of the method. The `emitter.send` method returns a `CompletionStage<Void>` . The returned future is completed when the message has been written to Kafka. If the writing fails, the returned `CompletionStage` is completed exceptionally.
zh_cn: 节点会返回一个 `CompletionStage` ，表明该方法是异步的。 `emitter.send` 方法返回一个 `CompletionStage<Void>` 。当消息被写入Kafka时，返回的Future就被认为i完成了。如果写入失败，返回的 `CompletionStage` 会抛出异常。

source: The endpoint sends the passed payload (from a `POST` HTTP request) to the emitter. The emitter's channel is mapped to a Kafka topic in the `application.properties` file:
zh_cn: 节点将已传递的payload(来自 `POST` HTTP请求)发送给emitter。emitter的 channel 被映射到 `application.properties` 文件中指定的一个Kafka topic：

source: The environment executing step `1` only needs Java and Maven (or Gradle) installed, while the environment executing step `3` only needs a GraalVM installation (including the `native-image` feature).
zh_cn: 执行步骤 `1` 的环境只需要安装Java和Maven（或Gradle），而执行步骤 `3` 的环境只需要安装GralVM（包括 `native-image` 功能）。

source: The example above obtains an access token for user `alice`.
zh_cn: 上面的命令为用户 `alice` 获取了一个访问token。

source: The example lambda takes input passed in via the `--payload` switch which points to a json file in the root directory of the project.
zh_cn: 这个lambda示例接受通过 `--payload` 开关传入的输入，该开关指向项目根目录中的一个json文件。

source: The executable built with `-Dquarkus-profile=test` is not suitable for production deployment. It contains your test resources files and settings. Once the testing is done, the executable would have to be built again, using the default, `prod` profile.
zh_cn: 使用 `-Dquarkus-profile=test` 构建的可执行文件不适合生产部署。它包含您的测试资源文件和设置。一旦测试完成，就必须使用默认的 `prod` 配置文件再次构建可执行文件。

source: The extension generates an example script within `target/bootstrap-example.sh`.
zh_cn: 扩展会在 `target/bootstrap-example.sh` 中生成了一个示例脚本。

source: The extension includes `kafka-clients` version 3.1.0 as a transitive dependency and is compatible with Kafka brokers version 2.x.
zh_cn: 该扩展包括 `kafka-clients` 3.1.0版本的传递依赖，而且与Kafka broker 2.x版本兼容。

source: The final order of business is to make the configuration file known to the `native-image` executable by adding the proper configuration to `application.properties`:
zh_cn: 最后一项工作是通过向 `application.properties` 添加适当的配置，使配置文件为 `native-image` 可执行文件所知：

source: The first application, the `producer`, will let the user request some quotes over an HTTP endpoint. For each quote request, a random identifier is generated and returned to the user, to put the quote request on _pending_. At the same time the generated request id is sent over the `quote-requests` queue.
zh_cn: 第一个应用程序 `producer` ，将让用户通过一个HTTP端点请求一些报价。对于每一个报价请求，都会生成一个随机标识符，并返回给用户，以便将报价请求放在 _pending_ 上。同时，生成的请求ID通过 `quote-requests` 队列被发送。

source: The first approach is by providing the properties within the `src/main/resources/application.properties` file:
zh_cn: 第一种方法是通过在 `src/main/resources/application.properties` 文件内提供配置:

source: The first stage builds the native executable using Maven or Gradle
zh_cn: 第一阶段使用Maven或Gradle构建原生可执行文件

source: The first step is to configure and start the https://opentelemetry.io/docs/collector/[OpenTelemetry Collector] to receive, process and export telemetry data to https://www.jaegertracing.io/[Jaeger] that will display the captured traces.
zh_cn: 第一步是配置和启动 link:https://opentelemetry.io/docs/collector/[OpenTelemetry Collector] ，以接收、处理和输出勘测数据到 link:https://www.jaegertracing.io/[Jaeger] 来显示捕获的traces。

source: The first thing to note is that for pure Java lambda deployments require a specific handler class. Do not change the Lambda handler name.
zh_cn: 首先需要注意的是，对于纯Java lambda部署，需要一个特定的处理程序类。不要改变Lambda处理程序的名称。

source: The following IDEs have support for the community developed Quarkus Tools:
zh_cn: 以下IDE支持社区开发的Quarkus工具：

source: The following attributes are configured using:
zh_cn: 以下属性通过该方式进行配置：

source: The following code provides an example:
zh_cn: 以下代码提供了一个例子：

source: The following configuration example demonstrates how you can enforce a single selectable authentication mechanism for a given request path:
zh_cn: 以下配置示例演示了如何强制要求对一个给定的请求路径选择一个认证机制：
